app/controllers/amps_controller.rb

	def index
		@amps = Amp.all
---
SELECT "amps".* FROM "amps"

	def create
		if amp = Amp.create(params[:amp])
---
INSERT INTO "amps" ("amp_channels", "amp_manufacturer", "amp_model", "amp_power", "amp_speakers", "amp_type", "amp_year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

	def edit
		id = params[:id]
		@amp = Amp.find(id)
---
SELECT "amps".* FROM "amps" WHERE "amps"."id" = ? LIMIT 1  [["id", "2"]]

	def update
		amp = Amp.find(params[:id])
		amp.update_attributes(params[:amp])
---
SELECT "amps".* FROM "amps" WHERE "amps"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "amps" SET "amp_channels" = 2, "updated_at" = '2013-09-18 21:08:52.546477' WHERE "amps"."id" = 1