app/controllers/guitars_controller.rb

	def index
		@guitars = Guitar.all
---
SELECT "guitars".* FROM "guitars"

	def create
		if guitar = Guitar.create(params[:guitar])
---
INSERT INTO "guitars" ("created_at", "guitar_color", "guitar_manufacturer", "guitar_model", "guitar_num_strings", "guitar_pickups", "guitar_set_neck", "guitar_type", "guitar_year", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def edit
		id = params[:id]
		@guitar = Guitar.find(id)
---
SELECT "guitars".* FROM "guitars" WHERE "guitars"."id" = ? LIMIT 1  [["id", "2"]]

	def update
		guitar = Guitar.find(params[:id])
		guitar.update_attributes(params[:guitar])
---
SELECT "guitars".* FROM "guitars" WHERE "guitars"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "guitars" SET "guitar_pickups" = 4, "updated_at" = '2013-09-18 20:08:04.772482' WHERE "guitars"."id" = 7

	def delete
		id = params[:id]
		Guitar.destroy(id)
---
DELETE FROM "guitars" WHERE "guitars"."id" = ?  [["id", 1]]