app/controllers/pedels_controller.rb

	def index
		@pedels = Pedel.all
---
SELECT "pedels".* FROM "pedels"

	def create
		if pedel = Pedel.create(params[:pedel])
---
INSERT INTO "pedels" ("created_at", "pedel_inputs", "pedel_manufacturer", "pedel_model", "pedel_outputs", "pedel_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

	def edit
		id = params[:id]
		@pedel = Pedel.find(id)
---
SELECT "pedels".* FROM "pedels" WHERE "pedels"."id" = ? LIMIT 1  [["id", "1"]]

	def update
		pedel = Pedel.find(params[:id])
		pedel.update_attributes(params[:pedel])
---
SELECT "pedels".* FROM "pedels" WHERE "pedels"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "pedels" SET "pedel_type" = 'ZVex', "pedel_outputs" = 2, "updated_at" = '2013-09-18 21:04:07.974528' WHERE "pedels"."id" = 3

	def delete
		id = params[:id]
		Pedel.destroy(id)
---
DELETE FROM "pedels" WHERE "pedels"."id" = ?  [["id", 1]]